let test = 0;
let q1 = prompt("Скільки раундів у професійному боксерському поєдинку?");
if (q1 == 12) {
  test += 1;
}
let q2 = prompt("Яка країна є батьківщиною футболу?");
if (q2 == "Англія") {
  test += 1;
}
let q3 = prompt(
  "Хто з відомих спортсменів носить прізвисько Король баскетболу?"
);
if (q3 == "Майкл Джордан") {
  test += 1;
}
let q4 = prompt("В якому виді спорту присуджують нагороду Золота бутса?");
if (q4 == "Футбол") {
  test += 1;
}
let q5 = prompt(
  "Скільки гравців знаходиться на полі в команді під час футбольного матчу?"
);
if (q5 == 11) {
  test += 1;
}
let q6 = prompt("Яка країна виграла найбільше чемпіонатів світу з футболу?");
if (q6 == "Бразилія") {
  test += 1;
}
let q7 = prompt("У якому виді спорту розігрується Кубок Стенлі?");
if (q7 == "Хокей") {
  test += 1;
}
let q8 = prompt(
  "Яка країна виграла перші Олімпійські ігри сучасності в Афінах у 1896 році?"
);
if (q8 == "Греція") {
  test += 1;
}
let q9 = prompt(
  "У якому виді спорту використовуються терміни бейбі-хук та данк?"
);
if (q9 == "Баскетбол") {
  test += 1;
}
let q10 = prompt(
  "Який вид спорту використовує такі снаряди, як кільця, бруси, колоди?"
);
if (q10 == "Гімнастика") {
  test += 1;
}
if (test >= 0 && test <= 4) {
  alert(
    `Раджу вам трошки почитати про спорт.   Правильні відповіді: ${test}/10`
  );
}
if (test >= 5 && test <= 8) {
  alert(`А ви добре розумієтесь у спорті.   Правильні відповіді: ${test}/10`);
}
if (test >= 9 && test <= 10) {
  alert(`Ви дуже розумна людина.   Правильні відповіді: ${test}/10`);
}
